Documents/бит_НачислениеЛьготПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеЛьготПоЛицевымСчетам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачислениеПоЛьготам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоНосителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоСемейной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСумм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПоЛьготам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПоЛьготам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНосителей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРазовых</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСемейной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_НачислениеЛьготПоЛицевымСчетам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мРасчетСУчетомДолейВладения                            Экспорт; // Хранит текущие значения параметров.
Перем мУменьшениеНормыЛьготыВПределахФакта                   Экспорт; // Хранит текущие значения параметров.
Перем мЛьготаПерсонифицированная                             Экспорт; // Хранит текущие значения параметров.
Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит текущие значения параметров.
Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит текущие значения параметров.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	Если ЭтоНовый() Тогда // Проверить объект на то, что он еще не внесен в ИБ.
		
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(ТекущаяДата()), Организация, ПараметрыЖКХ);
	Иначе
		
		бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	КонецЕсли;
	
	мРасчетСУчетомДолейВладения                            = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшениеНормыЛьготыВПределахФакта                   = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мЛьготаПерсонифицированная                             = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	
КонецПроцедуры

// Процедура производит расчеты. 
// И заполняет табличную часть.
//
Процедура РассчитатьНачисленияПоЛицевымСчетам() Экспорт 
	
	ОбновитьПараметрыЖКХ();
	
	ЛицевыеСчета.Очистить();
	СписокЛьгот.Очистить();
	
	СписокЛС     = Новый Массив;
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Здание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета";
	
	Запрос.УстановитьПараметр("Здание"            , Здание);
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	ТаблицаЛьгот = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(Дата
	,Организация
	,СписокЛС
	,СписокЗданий
	,
	,
	,
	,
	,
	,ТаблицаЛьгот
	,
	,
	,мРасчетСУчетомДолейВладения
	,мУменьшениеНормыЛьготыВПределахФакта
	,
	,
	,
	,мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика
	,мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
	
	СписокЛьгот.Загрузить(ТаблицаЛьгот);
	
	ТаблицаЛьгот.Свернуть("ЛицевойСчет,Услуга,Начислено");
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаЛьгот) ;
	
	ЗаполнениеСчетовКУ(ТаблицаЛьгот);
	
	ЛицевыеСчета.Загрузить(ТаблицаЛьгот);
	
КонецПроцедуры	

// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ(ТаблицаЛьгот=Неопределено )Экспорт 
	
	Если ТаблицаЛьгот = Неопределено тогда
		
		СписокЛС = ЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ЛицевыеСчета.ВыгрузитьКолонки().Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ЛицевыеСчета, Колонки, СписокЛС, Организация , Дата, , , , , Истина);
		
	Иначе
		
		СписокЛС = ТаблицаЛьгот.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТаблицаЛьгот.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТаблицаЛьгот, Колонки, СписокЛС, Организация , Дата, , , , , Истина);
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ПроцедурыИФункцииОбеспеченияПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить.
	ОбязательныеРеквизитыШапки = "Организация";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Услуга,Сумма"; // Через запятую.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокУслуг", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛьготам, Отказ, Заголовок)
	
	Если НЕ мЛьготаПерсонифицированная Тогда
		ДатаДока = Дата;
		НачислениеПоУсл = Движения.бит_НачисленияПоУслугамЖКХ;
		
		НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
		
		Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
			Если СтрокаТЧ.Начислено <> 0 тогда	
				Движение = НачислениеПоУсл.ДобавитьРасход();
				Движение.Период      = ДатаДока;
				Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
				Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
				Движение.Сумма       = СтрокаТЧ.Начислено;
				Движение.Организация   = СтруктураШапкиДокумента.Организация;
				
				ДвижениеУслПоПериоду = НачислениеПоУслПоПериоду.ДобавитьРасход();
				ДвижениеУслПоПериоду.Период				  = ДатаДока;
				ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
				ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
				ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока);
				ДвижениеУслПоПериоду.Сумма				  = СтрокаТЧ.Начислено;
				
				Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда
					Проводка = Движения.Хозрасчетный.Добавить();
					Проводка.Период     = СтруктураШапкиДокумента.Дата;
					Проводка.Содержание = "Начисление льгот по ЛС";
					Проводка.Организация = СтруктураШапкиДокумента.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
					Проводка.Сумма = СтрокаТЧ.Начислено;
				КонецЕсли;	
				
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли; 
	
	ДатаДока = Дата;
	НачислениеПоЛьготам = Движения.бит_НачислениеПоЛьготам;
	Для каждого СтрокаТЧ Из ТаблицаПоЛьготам Цикл
		Если НЕ СтрокаТЧ.Сумма = 0  ИЛИ НЕ СтрокаТЧ.СуммаСемейной = 0 тогда
			Движение = НачислениеПоЛьготам.Добавить();
			Движение.Период              = ДатаДока;
			Движение.ЛицевойСчет         = СтрокаТЧ.ЛицевойСчет;
			Движение.Услуга              = СтрокаТЧ.Услуга;
			Движение.Льгота              = СтрокаТЧ.Льгота;
			Движение.ФизЛицо             = СтрокаТЧ.Физлицо;
			Движение.Начислено           = СтрокаТЧ.Начислено;
			Движение.КоличествоНосителей = СтрокаТЧ.КоличествоНосителей;
			Движение.Сумма               = СтрокаТЧ.Сумма;
			Движение.СуммаСемейной       = СтрокаТЧ.СуммаСемейной;
			Движение.НормаЛьготы         = СтрокаТЧ.НормаЛьготы;
			Движение.Объем               = СтрокаТЧ.Объем;
		КонецЕсли; 	
	КонецЦикла;
	
	
КонецПроцедуры

// Проверка дублирования документа.
//
// Возвращаемое значение:
//   ТекстСообщения   – Строка.
//
Функция ПроверкаПовторовДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца" ,НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца"  ,КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация"  ,Организация);
	Запрос.УстановитьПараметр("Улица"        ,Улица);
	Запрос.УстановитьПараметр("Здание"       ,Здание);
	Запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НачислениеЛьготПоЛицевымСчетам.Ссылка,
	|	НачислениеЛьготПоЛицевымСчетам.Проведен,
	|	НачислениеЛьготПоЛицевымСчетам.Организация,
	|	НачислениеЛьготПоЛицевымСчетам.Улица,
	|	НачислениеЛьготПоЛицевымСчетам.Здание,
	|	НачислениеЛьготПоЛицевымСчетам.Дата
	|ИЗ
	|	Документ.бит_НачислениеЛьготПоЛицевымСчетам КАК НачислениеЛьготПоЛицевымСчетам
	|ГДЕ
	|	НачислениеЛьготПоЛицевымСчетам.Организация = &Организация
	|	И НачислениеЛьготПоЛицевымСчетам.Дата >= &НачалоМесяца
	|	И НачислениеЛьготПоЛицевымСчетам.Дата <= &КонецМесяца
	|	И (НЕ НачислениеЛьготПоЛицевымСчетам.ПометкаУдаления)
	|	И НачислениеЛьготПоЛицевымСчетам.Улица = &Улица
	|	И НачислениеЛьготПоЛицевымСчетам.Здание = &Здание
	|	И НачислениеЛьготПоЛицевымСчетам.Ссылка <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ТекстСообщения = "";
	Если Не Результат.Пустой() тогда
		ТекстСообщения = ТекстСообщения + "Документ в данном месяц уже создан.";
	КонецЕсли;
	Возврат ТекстСообщения;
	
Конецфункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ОбновитьПараметрыЖКХ();
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"  ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"       ,"Услуга");
	СтруктураПолей.Вставить("Начислено"    ,"Начислено");
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.ЛицевойСчет,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Услуга,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Льгота,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.ФизЛицо,
	|	СУММА(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.СуммаЛичной) КАК Сумма,
	|	СУММА(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.НачисленоСемейной) КАК СуммаСемейной,
	|	СУММА(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.КоличествоНосителей) КАК КоличествоНосителей,
	|	МАКСИМУМ(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Начислено) КАК Начислено,
	|	МАКСИМУМ(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.НормаЛьготы) КАК НормаЛьготы,
	|	СУММА(бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Объем) КАК Объем
	|ИЗ
	|	Документ.бит_НачислениеЛьготПоЛицевымСчетам.СписокЛьгот КАК бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот
	|ГДЕ
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.ЛицевойСчет,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Услуга,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Льгота,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.ФизЛицо,
	|	бит_НачислениеЛьготПоЛицевымСчетамСписокЛьгот.Объем";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);   
	ТаблицаПоЛьготам           = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛьготам, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Для новых документов установим время в конец дня.
	Если ЭтоНовый() Тогда
		ДатаБезВремени = НачалоДня(ТекущаяДата());
		
		Если ДатаБезВремени = Дата Тогда
			
			Дата = ТекущаяДата();
			
		КонецЕсли;
		
	КонецЕсли;
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СообщенияОповторахВидовОпераций = ПроверкаПовторовДокументов();
	Если ЗначениеЗаполнено(СообщенияОповторахВидовОпераций) Тогда
		ТекстСообщения = СообщенияОповторахВидовОпераций;
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
		ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	Для каждого Строка Из СписокЛьгот Цикл
		
		НоваяСтрока =  ТЗСписокЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
		
	КонецЦикла; 
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
